# /*
************************************************************
//					延时函数
************************************************************
*/
#include "../Common.h"

// *****************************************************************************
// 函数功能: 延时
// 入口参数: U16 wTimeCnt: 延时值
// 出口参数: void
// 说    明: 延时时间:T = bTimeCnt * 2+5 uS
// *****************************************************************************
void DelayUs2x(U16 wTimeCnt)
{   
	while(--wTimeCnt);
}

// *****************************************************************************
// 函数功能: 延时1ms
// 入口参数: U16 wTimeCnt: 延时值
// 出口参数: void
// 说    明: 大致延时1mS
// *****************************************************************************
void DelayMs(U16 wTimeCnt)
{ 
	while(wTimeCnt--)
	{
		DelayUs2x(115);
	}
}

void Debug_Output(U8 bCnt)
{ 
	DEBUG_HIGH();

	while(bCnt--)
	{
		DEBUG_LOW();
		DelayUs2x(1);
		DEBUG_HIGH();
	}
}

