/*-----------------------------------------------
  名称：串口通信
  网站：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：连接好串口或者usb转串口至电脑，下载该程序，打开电源
        打开串口调试程序，将波特率设置为9600，无奇偶校验
        晶振11.0592MHz，发送和接收使用的格式相同，如都使用
        字符型格式，设置正确后接受框可以看到UART test，技术论坛：www.doflye.net thank you!
------------------------------------------------*/

#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义                        
#include"uart.h"
#include "../Common.h"

// *****************************************************************************
// 函数功能: 串口初始化函数
// 入口参数: void
// 出口参数: void
// 说    明: 
// *****************************************************************************
void UART_Initial(void)
{
#if 1
	TMOD=0x20;		   //用定时器设置串口波特率    9600 
	TH1=0xfd;		   //赋初值  9600=(2的SMOD次方/32)*(TI的溢出率)=（1/32）*11059200/(256-X)*12 x=253
	TL1=0xfd;		   //赋初值
	TR1=1;			   //开启定时器1
	SM0=0;			   //模式选择
	SM1=1;
	REN=1;			   //串口初始化
	EA=1;			   //开启总中断
	ES=1;			   //开启串口中断

#else
    SCON  = 0x50;		        // SCON: 模式 1, 8-bit UART, 使能接收  
    TMOD |= 0x20;               // TMOD: timer 1, mode 2, 8-bit 重装
    TH1   = 0xFD;               // TH1:  重装值 9600 波特率 晶振 11.0592MHz  
    TR1   = 1;                  // TR1:  timer 1 打开                         
    //EA    = 1;                  //打开总中断
    //ES    = 1;                  //打开串口中断
#endif
}               

/*------------------------------------------------
                    发送一个字节
------------------------------------------------*/
void UART_SendByte(unsigned char dat)
{
	SBUF = dat;
	while(!TI);
	  TI = 0;
}

/*------------------------------------------------
                    发送一个字符串
------------------------------------------------*/
void UART_SendStr(unsigned char *s)
{
    UART_SendByte('\r');
	UART_SendByte('\n');

	while(*s!='\0')// \0 表示字符串结束标志，
	        //通过检测是否字符串末尾
	{
		UART_SendByte(*s);
		s++;
	}
}

/*------------------------------------------------
                发送一个ASCII码
------------------------------------------------*/
void UART_SendASCII(U8 bDat)
{
	U8  i;
	U8  bTmpDat[2];
	
	bTmpDat[0] = bDat >> 4;    // High 4 bit
	bTmpDat[1] = bDat & 0x0F;  // Low  4 bit

    for(i = 0; i < 2; i++)
	{
		if (bTmpDat[i] < 10)
		{
			UART_SendByte(48 + bTmpDat[i]);
		}
		else
		{		
			UART_SendByte(65 + bTmpDat[i] - 10);
		}
	}	
}

/*------------------------------------------------
                发送信息和数字
------------------------------------------------*/
void UART_SendInfor(U8 *pInfo, U16 dDat)
{
  	U8 *pDat = (U8  *)&dDat;
    
	UART_SendStr(pInfo);
	UART_SendASCII(*pDat--);
}



